WEB/advertisment-auth/app/controllers/authentication_controller.rb

  def authlogin
    username = params[:session]["name"]
    @user = User.find_by_name(params[:session]["name"])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "adfasdf"], ["LIMIT", 1]]